.svn/pristine/2c/2c90e6fb5c574424668ba3dedb1fd93d04418324.svn-base

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:b2b="http://www.apollomunichinsurance.com/B2BService" xmlns:pay="http://schemas.datacontract.org/2004/07/PaymentGatewayServiceLibrary" xmlns:ser="http://schemas.datacontract.org/2004/07/ServiceObjects">
   <soapenv:Header/>
   <soapenv:Body>
      <b2b:PaymentDetails>
         <!--Optional:-->
         <b2b:paymentGatewayServiceRequest>
            <!--Optional:-->
            <pay:PGDetail>
               <!--Optional:-->
               <ser:CrossSellCommonCode></ser:CrossSellCommonCode>
               <!--Optional:-->
               <ser:IPAddress>111.119.216.193</ser:IPAddress>
               <!--Optional:-->
               <ser:IsCrossSell></ser:IsCrossSell>
               <!--Optional:-->
               <ser:MerchantRefNo>180087</ser:MerchantRefNo>
               <!--Optional:-->
               <ser:PaymentId></ser:PaymentId>
               <!--Optional:-->
               <ser:PaymentUrl></ser:PaymentUrl>
               <!--Optional:-->
               <ser:ProposalId>___insurer_customer_identifier___</ser:ProposalId>
               <!--<ser:ProposalId>B115710114</ser:ProposalId>:-->
               <!--Optional:-->
               <!--<ser:ReturnUrl>___thankyouurl___</ser:ReturnUrl>:-->
               <ser:ReturnUrl>___return_url___</ser:ReturnUrl>
               <!--Optional:-->
               <ser:UDF1></ser:UDF1>
               <!--Optional:-->
               <ser:UDF2></ser:UDF2>
               <!--Optional:-->
               <ser:UDF3></ser:UDF3>
               <!--Optional:-->
               <ser:UDF4></ser:UDF4>
               <!--Optional:-->
               <ser:UDF5></ser:UDF5>
            </pay:PGDetail>
            <!--Optional:-->
            <pay:Partner>
               <!--Optional:-->
               <ser:PartnerCode>___insurer_integration_agent_code___</ser:PartnerCode>
               <!--Optional:-->
               <ser:Password>___insurer_integration_service_password___</ser:Password>
               <!--Optional:-->
               <ser:UserName>___insurer_integration_service_user___</ser:UserName>
            </pay:Partner>
         </b2b:paymentGatewayServiceRequest>
      </b2b:PaymentDetails>
   </soapenv:Body>
</soapenv:Envelope>
